
## Plan Result




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.apim_subscription_portal_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_portal_secondary_key[0]
  * module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.apim_subscription_portal_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_portal_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-portal-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_portal_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_portal_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-portal-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.apim_subscription_portal[0].azurerm_api_management_subscription.subscription will be created
  + resource "azurerm_api_management_subscription" "subscription" {
      + allow_tracing       = true
      + api_management_name = "sds-api-mgmt-stg"
      + display_name        = "PRE Portal subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + resource_group_name = "ss-stg-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":285,"Program":"tfcmt","SHA1":"","Vars":{}} -->